'''
ООП - объектно-ориентированное программирование

Классы и объекты классов

Класс
Cats:
    порода
    имя
    возраст

    
Объект класса 
Cats:
    русская
    Рыжик
    2

Инкапсуляция - это принцип согласно которому внутреннее устройство сущностей 
нужно объединять в специальной оболочке и скрывать от вмешательств извне.
Доступ к объектам возможен через специальные открытые методы, а напрямую обратить к их содержимому нельзя


Наследование - это концепция, согласно которой одни классы, называемые родительскими, могут лежать в основе других - дочерних.
При этом, дочерние классы перенимают свойства и поведение своего родителя


Полиморфизм - это способность обьекта использовать методы производного класса, который не существует на момент создания базового.
Возможность через единый интерфейс работать собъектами разных классов.
1) Ad hoc - реализовывался через перегрузку функций (в python не используется)
2) Параметрический полиморфизм
'''

